tutorials/verticalCondensasion/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 21.9E6;

boundaryField
{
    up
    {
        type            calculated;
        value           uniform 21.9E6;
    }
    down
    {
        type            calculated;
        value           uniform 21.9E6; 
        
    }
    left
    {
        type            calculated;
        value           uniform 21.9E6; 
        
    }
    freeStream
    {
          type            calculated;
        value           uniform 21.9E6;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
