tutorials/verticalCondensasion/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 646;

boundaryField
{
    up
    {
        type            fixedValue;
        value           uniform 646;
    }
    down
    {
        type            inletOutlet;
        inletValue      uniform 646;
        value           uniform 646;
    }
    left
    {
        type            fixedValue;
        value           uniform 626;
    }
    freeStream
    {
        type            inletOutlet;
        inletValue      uniform 646;
        value           uniform 646;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
