tutorials/verticalCondensasion/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0.0
);

regions        
(
    boxToCell
    {
        boxes
        (
            (-1  -1 -1)
            (0.5e-5 11e-3 0.0002e-03 )
        );
        fieldValues
        (
            volScalarFieldValue alpha.water 1.0
        );
    }
);


// ************************************************************************* //
