tutorials/verticalCondensasion/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions.
. $WM_PROJECT_DIR/bin/tools/CleanFunctions  # Tutorial clean functions


interfaceMethods="
isoAdvector
MULES
"

# MAXX="10 20 30 40 50 60 80 90 100 120 150 180 25 75 125 175"
MAXX="50 100"

NC="16"

for XN in $NC
    do
        echo "Setting number of cores to $XN"
        sed "s/XN/$XN/g" system/decomposeParDict.template \
        > system/decomposeParDict
        
        for XM in $MAXX
            do
                echo "Setting grid number in X direction to $XM"
                sed "s/XM/$XM/g" system/blockMeshDict.template \
                > system/blockMeshDict
                
                for method in $interfaceMethods
                    do

                        echo "Setting interface tracking method to $method"

                        sed -e "s/INTERFACE_METHOD/$method/g" \
                        system/fvSolution.template \
                        > system/fvSolution

                        restore0Dir
                        touch foam.foam
                        runApplication blockMesh
                        runApplication setFields
                        runApplication decomposePar
                        runParallel $(getApplication)
                        runApplication reconstructPar

                        methodDir="$method$XM"
                        mkdir "$method$XM"
                        cp -r system constant "$method$XM"
                        mv -f  *.dat log.* foam.foam postProcessing 0 0.9 1 "$method$XM"
                        cleanCase0
                        done
            done
    done


#------------------------------------------------------------------------------
